# Pandas

In [3]:
import pandas as pd

In [4]:
import numpy as np

# series

In [5]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
np.array([1,2,3,4])

array([1, 2, 3, 4])

In [9]:
pd.Series([1,2,3,4], index = ['A','B','C','D'])

A    1
B    2
C    3
D    4
dtype: int64

In [11]:
pd.Series([10,20,30,40],dtype="float",name="Marks")

0    10.0
1    20.0
2    30.0
3    40.0
Name: Marks, dtype: float64

# DataFrame

In [13]:
pd.DataFrame([[1,2,3],[4,5,6]])

   0  1  2
0  1  2  3
1  4  5  6

In [15]:
df = pd.DataFrame(np.arange(10,20).reshape(5,2),columns=["A","B"])

In [16]:
df

    A   B
0  10  11
1  12  13
2  14  15
3  16  17
4  18  19

In [17]:
heroes = [("batman",70),("superman",80),("spiderman",60),("ironman",100)]

In [18]:
heroes

[('batman', 70), ('superman', 80), ('spiderman', 60), ('ironman', 100)]

In [19]:
pd.DataFrame(heroes,columns=["name","power"])

        name  power
0     batman     70
1   superman     80
2  spiderman     60
3    ironman    100

In [20]:
dic = {'name':['Jitesh','Kalpesh','Kiran'],'math':[80,70,85],'science':[78,56,68]}

In [21]:
dic

{'name': ['Jitesh', 'Kalpesh', 'Kiran'],
 'math': [80, 70, 85],
 'science': [78, 56, 68]}

In [23]:
df = pd.DataFrame(dic)

In [24]:
df

      name  math  science
0   Jitesh    80       78
1  Kalpesh    70       56
2    Kiran    85       68

# Indexing and Slicing

In [25]:
df["name"]

0     Jitesh
1    Kalpesh
2      Kiran
Name: name, dtype: object

In [27]:
df[["name","science"]]

      name  science
0   Jitesh       78
1  Kalpesh       56
2    Kiran       68

In [28]:
df.iloc[1]

name       Kalpesh
math            70
science         56
Name: 1, dtype: object

In [29]:
df.iloc[0:2]

      name  math  science
0   Jitesh    80       78
1  Kalpesh    70       56

In [30]:
df.iloc[0:2,0:2]

      name  math
0   Jitesh    80
1  Kalpesh    70

In [32]:
df.loc[0:2,"math"]

0    80
1    70
2    85
Name: math, dtype: int64

In [33]:
df.loc[1,"math"]

70

In [34]:
df.loc[0:1,"math"]

0    80
1    70
Name: math, dtype: int64

In [36]:
df.loc[0:2,["math","science"]]

   math  science
0    80       78
1    70       56
2    85       68

In [37]:
df.loc[0:1,["math","science"]]

   math  science
0    80       78
1    70       56

In [38]:
df

      name  math  science
0   Jitesh    80       78
1  Kalpesh    70       56
2    Kiran    85       68

In [39]:
df["math"][0]

80

In [40]:
df.iloc[0,1]   #[row,column] #iloc-exclusive #loc-inclusive

80

In [41]:
df.loc[0,"math"]

80

In [42]:
df["science"][2]

68

In [50]:
df.loc[0:2,["math","science"]]

   math  science
0    80       78
1    70       56
2    85       68

In [51]:
df.loc[0:2,["math","science","name"]]

   math  science     name
0    80       78   Jitesh
1    70       56  Kalpesh
2    85       68    Kiran

In [56]:
df.iloc[0,2]

78

In [57]:
df.loc[0,["science"]]

science    78
Name: 0, dtype: object

In [58]:
df["science"][0]

78

# Extracting Data From various sources

# 1.Clipboard

In [70]:
pd.read_clipboard()

   OrderDate   Region      Rep     Item  Units  Unit Price
0  04-Jul-14     East  Richard  Pen Set     62        4.99
1  12-Jul-14     East     Nick   Binder     29        1.99
2  21-Jul-14  Central   Morgan  Pen Set     55       12.49
3  29-Jul-14     East    Susan   Binder     81       19.99

# 2.Read csv file

In [75]:
pd.read_csv('marks.csv')

  name:marks
0  paresh:90
1   ritik:45
2     anu:74

In [76]:
pd.read_csv('marks.csv',sep=":")

     name  marks
0  paresh     90
1   ritik     45
2     anu     74

# Understanding Data

In [77]:
df = pd.read_csv("cars.csv")

In [78]:
df

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,13495
1,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,16500
2,1,?,alfa-romero,gas,hatchback,rwd,front,65.5,52.4,ohcv,152,154,19,26,16500
3,2,164,audi,gas,sedan,fwd,front,66.2,54.3,ohc,109,102,24,30,13950
4,2,164,audi,gas,sedan,4wd,front,66.4,54.3,ohc,136,115,18,22,17450
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
200,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohc,141,114,23,28,16845
201,-1,95,volvo,gas,sedan,rwd,front,68.8,55.5,ohc,141,160,19,25,19045
202,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohcv,173,134,18,23,21485
203,-1,95,volvo,diesel,sedan,rwd,front,68.9,55.5,ohc,145,106,26,27,22470
204,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohc,141,114,19,25,22625

In [79]:
df.head()

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,13495
1,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,16500
2,1,?,alfa-romero,gas,hatchback,rwd,front,65.5,52.4,ohcv,152,154,19,26,16500
3,2,164,audi,gas,sedan,fwd,front,66.2,54.3,ohc,109,102,24,30,13950
4,2,164,audi,gas,sedan,4wd,front,66.4,54.3,ohc,136,115,18,22,17450

In [80]:
df.head(2)

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,13495
1,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,16500

In [81]:
df.tail()

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
200,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohc,141,114,23,28,16845
201,-1,95,volvo,gas,sedan,rwd,front,68.8,55.5,ohc,141,160,19,25,19045
202,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohcv,173,134,18,23,21485
203,-1,95,volvo,diesel,sedan,rwd,front,68.9,55.5,ohc,145,106,26,27,22470
204,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohc,141,114,19,25,22625

In [83]:
df.columns

Index(['symboling', 'normalized-losses', 'make', 'fuel-type', 'body-style',
       'drive-wheels', 'engine-location', 'width', 'height', 'engine-type',
       'engine-size', 'horsepower', 'city-mpg', 'highway-mpg', 'price'],
      dtype='object')

In [85]:
df.shape   #(rows,columns)

(205, 15)

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 15 columns):
symboling            205 non-null int64
normalized-losses    205 non-null object
make                 205 non-null object
fuel-type            205 non-null object
body-style           205 non-null object
drive-wheels         205 non-null object
engine-location      205 non-null object
width                205 non-null float64
height               205 non-null float64
engine-type          205 non-null object
engine-size          205 non-null int64
horsepower           205 non-null object
city-mpg             205 non-null int64
highway-mpg          205 non-null int64
price                205 non-null int64
dtypes: float64(2), int64(5), object(8)
memory usage: 24.1+ KB

In [88]:
df.describe()

,symboling,width,height,engine-size,city-mpg,highway-mpg,price
count,205.000000,205.000000,205.000000,205.000000,205.000000,205.000000,205.000000
mean,0.834146,65.907805,53.724878,126.907317,25.219512,30.751220,13227.478049
std,1.245307,2.145204,2.443522,41.642693,6.542142,6.886443,7902.651615
min,-2.000000,60.300000,47.800000,61.000000,13.000000,16.000000,5118.000000
25%,0.000000,64.100000,52.000000,97.000000,19.000000,25.000000,7788.000000
50%,1.000000,65.500000,54.100000,120.000000,24.000000,30.000000,10345.000000
75%,2.000000,66.900000,55.500000,141.000000,30.000000,34.000000,16500.000000
max,3.000000,72.300000,59.800000,326.000000,49.000000,54.000000,45400.000000

In [89]:
df.isnull()

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
200,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
201,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
202,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
203,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
204,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [91]:
df.isna().sum()

symboling            0
normalized-losses    0
make                 0
fuel-type            0
body-style           0
drive-wheels         0
engine-location      0
width                0
height               0
engine-type          0
engine-size          0
horsepower           0
city-mpg             0
highway-mpg          0
price                0
dtype: int64

In [92]:
df["make"].unique()

array(['alfa-romero', 'audi', 'bmw', 'chevrolet', 'dodge', 'honda',
       'isuzu', 'jaguar', 'mazda', 'mercedes-benz', 'mercury',
       'mitsubishi', 'nissan', 'peugot', 'plymouth', 'porsche', 'renault',
       'saab', 'subaru', 'toyota', 'volkswagen', 'volvo'], dtype=object)

In [93]:
df["engine-type"].unique()

array(['dohc', 'ohcv', 'ohc', 'l', 'rotor', 'ohcf', 'dohcv'], dtype=object)

In [96]:
df["make"].value_counts()

toyota           32
nissan           18
mazda            17
honda            13
mitsubishi       13
subaru           12
volkswagen       12
volvo            11
peugot           11
dodge             9
bmw               8
mercedes-benz     8
plymouth          7
audi              7
saab              6
porsche           5
isuzu             4
alfa-romero       3
jaguar            3
chevrolet         3
renault           2
mercury           1
Name: make, dtype: int64

In [97]:
df["engine-type"].value_counts()

ohc      148
ohcf      15
ohcv      13
l         12
dohc      12
rotor      4
dohcv      1
Name: engine-type, dtype: int64